In [ ]:
%%capture
from functions import *
from ipynb.fs.full.Student_Information import stud_info
from ipynb.fs.full.Courses import courses

# Assessments
---

## Assessments
---

The assessments dataframe contains information about the unique assessments in each code module and presentation.

In [2]:
# show assessments dataframe
assessments.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

**Size**

In [3]:
# function to get a dataframe of rows and columns
get_size(assessments)

         Count
Columns      6
Rows       206

In [4]:
md(f'''
Assessments has {len(assessments.columns)} features describing {len(assessments)} exam records.
''')

Assessments has 6 features describing 206 exam records.

---

### Assessments Contents

* **code_module**: The code module represents the code name of the course the assessment was held for.
* **code_presentation**: The presentation represents the presentation which the test was held for.
* **id_assessment**: The assessment ID is the unique identifier for each assessment.
* **assessment_type**: The assessment type represents the kind of assessment it was.
    - There are three assessment types:
        * TMA: Tutor Marked Assessment
        * CMA: Computer Marked Assessment
        * Exam: The Final Exam
* **date**: The date is how many days from the start of the course the assessment took place
* **weight**: The weight is the weighted value of the assessment. Exams should have a weight of 100 which the rest of the assessments should add to 100 in total.

* column names will be changed to be less verbose
    * code_module to module
    * code_presentation to presentation

In [5]:
assessments_rename = {'code_module':'module', 'code_presentation':'presentation'}
assessments = assessments.rename(columns=assessments_rename)

## Student Assessment

---

The Student Assessments dataframe contains information about each student and the assessments they took during the module

In [6]:
student_assessment.head()

   id_assessment  id_student  date_submitted  is_banked  score
0           1752       11391              18          0   78.0
1           1752       28400              22          0   70.0
2           1752       31604              17          0   72.0
3           1752       32885              26          0   69.0
4           1752       38053              19          0   79.0

**Size**

In [7]:
# get the size of student_assessment
get_size(student_assessment)

          Count
Columns       5
Rows     173912

In [8]:
# store the size of student_assessment's columns
sa_cols = len(student_assessment.columns)
# store the size of student_assessment's rows
sa_rows = len(student_assessment)
md(f'''
Student Assessment has {sa_cols} columns and {"{:,}".format(sa_rows)} rows, which is how many exams we have data for.
''')

Student Assessment has 5 columns and 173,912 rows, which is how many exams we have data for.

---

### Student Assessment Contents

* **id_assessment**: The assessment ID is the unique identifier for the assessment the student took.
* **id_student**: The student ID is the unique identifier for the student who took the assessment.
* **date_submitted**: The date submitted is the date the student submitted the exam relevant to the start date of the module.
* **is_banked**: Whether the score for the assessment is banked indicates wheter the assessment result was transferred from a previous presentation.
    - is_banked has no relevant information to our analysis and can be removed
* **score**: The score the student received for the assessment. 40 or above is considered a passing score.

* column names will be changed to be less verbose
    * code_module to module
    * code_presentation to presentation

---

### Assessments Information

**Data Types**

In [9]:
# function to get a dataframe of data types
get_dtypes(assessments)

* `id_assessments` is a categorical value and so should be converted to `string`
* `object` types should be converted to strings
* Both of the `float64` typed variables are whole numbers and should be converted to `int64`

In [10]:
# converting the data types
# id assessment to string
assessments['id_assessment'] = assessments['id_assessment'].astype(str)
# all other data types to those which support pandas <NA>
assessments = assessments.convert_dtypes(convert_integer=False)

**Null Values**

In [11]:
# function to return dataframe of nulls in columns
null_vals(assessments)

In [12]:
md(f'''
* We have {assessments['date'].isnull().sum()} null data points for assessment date. 
* The documentation of this dataset states that if the exam date is missing then it is as the end of the last presentation week. 
* We can find this information in the courses dataframe, and add them in to get rid of the NaNs.
''')

* We have 11 null data points for assessment date.
* The documentation of this dataset states that if the exam date is missing then it is as the end of the last presentation week.
* We can find this information in the courses dataframe, and add them in to get rid of the NaNs.

In [13]:
# adding the dates for the null test dates
for index, row in assessments[assessments['date'].isna()].iterrows():
    assessments.at[index, 'date'] = courses.loc[(courses['module'] == row['module']) & (courses['presentation'] == row['presentation']), 'module_presentation_length']

# reprinting to ensure it worked
dataframe(assessments.isnull().sum(), columns=['Null Values'])

                 Null Values
module                     0
presentation               0
id_assessment              0
assessment_type            0
date                       0
weight                     0

**Unique Counts**

In [14]:
# function to get unique value counts
count_unique(assessments)

In [15]:
md(f'''
There are {assessments['id_assessment'].nunique()} unique assessment ID's
''')

There are 206 unique assessment ID's

**Unique Categorical Values**

In [16]:
# function to get unique categorical values in columns
unique_vals(assessments)

Everything here is as we would expect in the data's description

In [17]:
# get the value counts for each type of exam
dataframe(assessments['assessment_type'].value_counts())

      assessment_type
TMA               106
CMA                76
Exam               24

In [18]:
TMA_count = assessments['assessment_type'].value_counts()[0]
CMA_count = assessments['assessment_type'].value_counts()[1]
exam_count = assessments['assessment_type'].value_counts()[2]
md(f'''
There are {TMA_count} Tutor Marked Assessements, {CMA_count} Computer Marked Assessments and {exam_count} Final Exams in our data.
''')

There are 106 Tutor Marked Assessements, 76 Computer Marked Assessments and 24 Final Exams in our data.

In [19]:
md('''
Our data source tells us that final exams are weighted 100 and the weights of the rest of the exams in a module should amount to 100.
 So each module should have a total weight of 200.
''')

Our data source tells us that final exams are weighted 100 and the weights of the rest of the exams in a module should amount to 100.
 So each module should have a total weight of 200.

In [20]:
pd.pivot_table(assessments, index=['presentation', 'module'], values='weight', aggfunc=np.sum)

                     weight
presentation module
2013B        BBB      200.0
             DDD      200.0
             FFF      200.0
2013J        AAA      200.0
             BBB      200.0
             DDD      200.0
             EEE      200.0
             FFF      200.0
             GGG      100.0
2014B        BBB      200.0
             CCC      300.0
             DDD      200.0
             EEE      200.0
             FFF      200.0
             GGG      100.0
2014J        AAA      200.0
             BBB      200.0
             CCC      300.0
             DDD      200.0
             EEE      200.0
             FFF      200.0
             GGG      100.0

This pivot table shows the module presentation, the module and the total of the weights of the exams in the module.
Because the final exam is weighted 100 and the other exams should form another 100 we should have 200 points in each module. We see here that CCC modules 300 in total weight and GGG modules have 100 in total weight.

In [21]:
ccc_ggg_weights = assessments.loc[(assessments['module'] == 'CCC') | (assessments['module'] == 'GGG')]
ccc_ggg_weights = ccc_ggg_weights[['module', 'id_assessment', 'assessment_type', 'weight']]
ccc_ggg_weights

    module id_assessment assessment_type  weight
54     CCC         24286             CMA     2.0
55     CCC         24287             CMA     7.0
56     CCC         24288             CMA     8.0
57     CCC         24289             CMA     8.0
58     CCC         24282             TMA     9.0
59     CCC         24283             TMA    22.0
60     CCC         24284             TMA    22.0
61     CCC         24285             TMA    22.0
62     CCC         24290            Exam   100.0
63     CCC         40087            Exam   100.0
64     CCC         24295             CMA     2.0
65     CCC         24296             CMA     7.0
66     CCC         24297             CMA     8.0
67     CCC         24298             CMA     8.0
68     CCC         24291             TMA     9.0
69     CCC         24292             TMA    22.0
70     CCC         24293             TMA    22.0
71     CCC         24294             TMA    22.0
72     CCC         24299            Exam   100.0
73     CCC         40088            Exam   100.0
176    GGG         37418             CMA     0.0
177    GGG         37419             CMA     0.0
178    GGG         37420             CMA     0.0
179    GGG         37421             CMA     0.0
180    GGG         37422             CMA     0.0
181    GGG         37423             CMA     0.0
182    GGG         37415             TMA     0.0
183    GGG         37416             TMA     0.0
184    GGG         37417             TMA     0.0
185    GGG         37424            Exam   100.0
186    GGG         37428             CMA     0.0
187    GGG         37429             CMA     0.0
188    GGG         37430             CMA     0.0
189    GGG         37431             CMA     0.0
190    GGG         37432             CMA     0.0
191    GGG         37433             CMA     0.0
192    GGG         37425             TMA     0.0
193    GGG         37426             TMA     0.0
194    GGG         37427             TMA     0.0
195    GGG         37434            Exam   100.0
196    GGG         37438             CMA     0.0
197    GGG         37439             CMA     0.0
198    GGG         37440             CMA     0.0
199    GGG         37441             CMA     0.0
200    GGG         37442             CMA     0.0
201    GGG         37443             CMA     0.0
202    GGG         37435             TMA     0.0
203    GGG         37436             TMA     0.0
204    GGG         37437             TMA     0.0
205    GGG         37444            Exam   100.0

We can see here that CCC Modules had two final exams, and the GGG module's full course weight consisted only of a final exam. 

The data source mentions some final exams may be missing scores, so instead of dealing with this problem here, we will come back to this problem after we have explored student_assessment in case the missing final exam scores prove problematic.

**Duplicate Values:**

In [22]:
get_dupes(assessments)

There are no Duplicate Values

**Numerical Values**

In [23]:
assessments.describe().round(2)

         date  weight
count  206.00  206.00
mean   150.97   20.87
std     78.16   30.38
min     12.00    0.00
25%     81.25    0.00
50%    159.00   12.50
75%    227.00   24.25
max    269.00  100.00

In [24]:
mean_weight = round(assessments['weight'].mean(), 2)
md(f'''
The average test is weighted at {mean_weight}, which makes sense as there is normally 5 tests adding to 100 and then a final which likely brings up that mean.
''')

The average test is weighted at 20.87, which makes sense as there is normally 5 tests adding to 100 and then a final which likely brings up that mean.

---

### Student Assessment Information

**Data Types**

In [25]:
# get student_assessment column datatypes
get_dtypes(student_assessment)

* `id_student` and `id_assessments` are both categorical values and so should be converted from `int64` to `string`

In [26]:
# converting the data types
student_assessment = student_assessment.astype({'id_assessment': str, 'id_student': str})
# change student_assessment datatypes to values pandas supports better
student_assessment = student_assessment.convert_dtypes()
dataframe(student_assessment.dtypes, columns=['Data Type'])

               Data Type
id_assessment     string
id_student        string
date_submitted     Int64
is_banked          Int64
score              Int64

**Duplicate Values**

In [27]:
# gives a dataframe of duplicate values if any
get_dupes(student_assessment)

There are no Duplicate Values

**Unique Value Counts**

In [28]:
# gives a dataframe of counts of unique values per column
count_unique(student_assessment)

In [29]:
assmnt_count = student_assessment['id_assessment'].nunique()
total_assmnts = assessments['id_assessment'].nunique()
assmnt_unique_students = student_vle['id_student'].nunique()
si_unique_students = stud_info['id_student'].nunique()
md(f'''
* There are {assmnt_count} unique assessments that students took.
* This is less than the {total_assmnts} assessments we observed in the assessments dataframe meaning that there are some assessments on record that students did not take.
* There are {"{:,}".format(assmnt_unique_students)} in student_assessment out of the {"{:,}".format(si_unique_students)} 
students we have in student info. So {"{:,}".format(si_unique_students - assmnt_unique_students)} students from student info do not have assessment data.
''')

* There are 188 unique assessments that students took.
* This is less than the 206 assessments we observed in the assessments dataframe meaning that there are some assessments on record that students did not take.
* There are 26,074 in student_assessment out of the 28,785
students we have in student info. So 2,711 students from student info do not have assessment data.

**Numerical Values**

In [30]:
student_assessment.describe().round(1)

       date_submitted  is_banked     score
count        173912.0   173912.0  173739.0
mean            116.0        0.0      75.8
std              71.5        0.1      18.8
min             -11.0        0.0       0.0
25%              51.0        0.0      65.0
50%             116.0        0.0      80.0
75%             173.0        0.0      90.0
max             608.0        1.0     100.0

In [31]:
mean_score = student_assessment['score'].mean().round(1)
date_max = student_assessment['date_submitted'].max()
date_min = student_assessment['date_submitted'].min()
max_course_length = courses['module_presentation_length'].max()
md(f'''
* The average test score is {mean_score} so most students are passing handily if 40 is considered a failing score.
* The minimum date_submitted is {date_min} so it is possible the students had access to the first exam early, or that there is errors in the data.
 * They don't fall too far outside the range, so we will keep those as they are
* The maximum date submitted is {date_max}, which is around 2.5 times longer than any course went on for.
* Let's check for records that are over the maximum course length of {max_course_length} days.
''')

* The average test score is 75.8 so most students are passing handily if 40 is considered a failing score.
* The minimum date_submitted is -11 so it is possible the students had access to the first exam early, or that there is errors in the data.
 * They don't fall too far outside the range, so we will keep those as they are
* The maximum date submitted is 608, which is around 2.5 times longer than any course went on for.
* Let's check for records that are over the maximum course length of 269 days.

In [32]:
late_tests = student_assessment.loc[student_assessment['date_submitted'] > 269].sort_values(by='date_submitted').reset_index(drop=True)
late_tests.head()

  id_assessment id_student  date_submitted  is_banked  score
0         15022    1723749             270          0   <NA>
1         30722     691701             274          0   <NA>
2         25368    2341830             279          0     49
3         24299     555498             285          0     58
4         34879     595935             287          0     96

In [33]:
late_test_count = len(late_tests['date_submitted'])
late_test_min = late_tests['date_submitted'].min()
late_test_max = late_tests['date_submitted'].max()
late_test_avg = late_tests['date_submitted'].mean().round(1)
md(f'''
* There are {late_test_count} records of students handing in their exams well after the end of the module.
* These dates range from {late_test_min} days after the course began and {late_test_max} days after the course began with an average of {late_test_avg} days.
* The data source makes no mention of these, and they should not affect our analysis, so though strange, we will leave these records
''')

* There are 73 records of students handing in their exams well after the end of the module.
* These dates range from 270 days after the course began and 608 days after the course began with an average of 470.2 days.
* The data source makes no mention of these, and they should not affect our analysis, so though strange, we will leave these records

**Null Values**

In [34]:
# get null values if any
null_vals(student_assessment)

In [36]:
null_score = student_assessment['score'].isnull().sum()
md(f'''
* We have {null_score} null values for score, which is important as it is a value we will be trying to predict.
* These may be the missing final exam scores. To know that we will have to merge the assessments and student_assessment dataframes so
we have the score, assessment ID and module/presentation in one place.
''')

* We have 173 null values for score, which is important as it is a value we will be trying to predict.
* These may be the missing final exam scores. To know that we will have to merge the assessments and student_assessment dataframes so
we have the score, assessment ID and module/presentation in one place.

**Merged Asssessments**

Here we will merge the assessments and student assessments dataframes in order to combine our student scores and submission dates with assessment type, date of the assessment, and weight of the assessment.

In [37]:
# merges dataframes student_assessment with assessments with a full outer join on their common ID id_assessment
# creates a column _merge which tells you if the id_assessment was found in one or both dataframes
merged_assessments = student_assessment.merge(assessments, how='outer', on=['id_assessment'] ,indicator=True)
merged_assessments = merged_assessments.astype({'id_student': str, 'id_assessment':str}).convert_dtypes()
merged_assessments.head()

,id_assessment,id_student,date_submitted,is_banked,score,module,presentation,assessment_type,date,weight,_merge
0,1752,11391,18,0,78,AAA,2013J,TMA,19.0,10.0,both
1,1752,28400,22,0,70,AAA,2013J,TMA,19.0,10.0,both
2,1752,31604,17,0,72,AAA,2013J,TMA,19.0,10.0,both
3,1752,32885,26,0,69,AAA,2013J,TMA,19.0,10.0,both
4,1752,38053,19,0,79,AAA,2013J,TMA,19.0,10.0,both

Our new `_merge` column tells us if the data maps perfectly, or if it is only found on the right or left side, the right side being the assessments dataframe and the left side being the student_assessments dataframe.

In [38]:
# make a dataframe of students with a score of 0 and display it
na_scores = merged_assessments.loc[merged_assessments['score'].isna(), ['presentation', 'module', 'weight', 'id_assessment']]
dataframe(na_scores.value_counts(subset=['id_assessment', 'weight']), columns=['NA Exam Count'])

                      NA Exam Count
id_assessment weight
25339         15.0                7
15013         18.0                7
34860         12.5                6
14998         18.0                5
25363         10.0                5
...                             ...
30714         16.0                1
30715         28.0                1
30718         100.0               1
30719         16.0                1
40088         100.0               1

[96 rows x 1 columns]

In [40]:
non_100_na = na_scores.loc[na_scores['weight'] != 100]
weight_100_na = na_scores.loc[na_scores['weight'] == 100]
md(f'''
Above we can see a dataframe of the exams which have NA scores and the count of how many NA scores they have. 
* {na_scores['id_assessment'].nunique()} out of {len(assessments)} assessments have at least one NA score.
* {weight_100_na['id_assessment'].nunique()} exams  with NA scores are final exams
* {non_100_na['id_assessment'].nunique()} exams with NA scores are not final exams
''')

Above we can see a dataframe of the exams which have NA scores and the count of how many NA scores they have.
* 96 out of 206 assessments have at least one NA score.
* 18 exams  with NA scores are final exams
* 78 exams with NA scores are not final exams

In [43]:
# make a dataframe of students with a score of 0 and display it
zero_scores = student_assessment.loc[student_assessment['score'] == 0]
zero_scores.head()

     id_assessment id_student  date_submitted  is_banked  score
785           1754    2456480             123          0      0
4322         14984     554986              24          0      0
4730         14985     141823              46          0      0
5391         14985     542259              46          0      0
5509         14985     549078              48          0      0

In [44]:
md(f'''
The first thing to check would be whether there are students with a 0 for a score to see if the NaNs represent 0's.
Above is a dataframe of length {len(zero_scores)} for records of assessments with a 0 score, 
so the NaNs are not necessarily 0's.
''')

The first thing to check would be whether there are students with a 0 for a score to see if the NaNs represent 0's.
Above is a dataframe of length 329 for records of assessments with a 0 score,
so the NaNs are not necessarily 0's.

In [62]:
md(f'''
**Rows that do not map**

First we will deal with the missing final exam scores. We have found that {weight_100_na['id_assessment'].nunique()} exams have students with
NA scores, but our `_merge` column suggests that there are some exams only found in assessments. Let's look at those missing exams''')

**Rows that do not map**

First we will deal with the missing final exam scores. We have found that 18 exams have students with
NA scores, but our `_merge` column suggests that there are some exams only found in assessments. Let's look at those missing exams

In [61]:
missing_exams = merged_assessments.loc[merged_assessments['_merge'] != 'both'].reset_index(drop=True)
missing_exams

,id_assessment,id_student,date_submitted,is_banked,score,module,presentation,assessment_type,date,weight,_merge
0,1757,<NA>,<NA>,<NA>,<NA>,AAA,2013J,Exam,268.0,100.0,right_only
1,1763,<NA>,<NA>,<NA>,<NA>,AAA,2014J,Exam,269.0,100.0,right_only
2,14990,<NA>,<NA>,<NA>,<NA>,BBB,2013B,Exam,240.0,100.0,right_only
3,15002,<NA>,<NA>,<NA>,<NA>,BBB,2013J,Exam,268.0,100.0,right_only
4,15014,<NA>,<NA>,<NA>,<NA>,BBB,2014B,Exam,234.0,100.0,right_only
5,15025,<NA>,<NA>,<NA>,<NA>,BBB,2014J,Exam,262.0,100.0,right_only
6,40087,<NA>,<NA>,<NA>,<NA>,CCC,2014B,Exam,241.0,100.0,right_only
7,40088,<NA>,<NA>,<NA>,<NA>,CCC,2014J,Exam,269.0,100.0,right_only
8,30713,<NA>,<NA>,<NA>,<NA>,EEE,2013J,Exam,235.0,100.0,right_only
9,30718,<NA>,<NA>,<NA>,<NA>,EEE,2014B,Exam,228.0,100.0,right_only
10,30723,<NA>,<NA>,<NA>,<NA>,EEE,2014J,Exam,235.0,100.0,right_only
11,34872,<NA>,<NA>,<NA>,<NA>,FFF,2013B,Exam,222.0,100.0,right_only
12,34885,<NA>,<NA>,<NA>,<NA>,FFF,2013J,Exam,236.0,100.0,right_only
13,34898,<NA>,<NA>,<NA>,<NA>,FFF,2014B,Exam,227.0,100.0,right_only
14,34911,<NA>,<NA>,<NA>,<NA>,FFF,2014J,Exam,241.0,100.0,right_only
15,37424,<NA>,<NA>,<NA>,<NA>,GGG,2013J,Exam,229.0,100.0,right_only
16,37434,<NA>,<NA>,<NA>,<NA>,GGG,2014B,Exam,222.0,100.0,right_only
17,37444,<NA>,<NA>,<NA>,<NA>,GGG,2014J,Exam,229.0,100.0,right_only

In [55]:
assessments.loc[assessments['assessment_type'] == 'Exam']

    module presentation id_assessment assessment_type   date  weight
5      AAA        2013J          1757            Exam  268.0   100.0
11     AAA        2014J          1763            Exam  269.0   100.0
23     BBB        2013B         14990            Exam  240.0   100.0
35     BBB        2013J         15002            Exam  268.0   100.0
47     BBB        2014B         15014            Exam  234.0   100.0
53     BBB        2014J         15025            Exam  262.0   100.0
62     CCC        2014B         24290            Exam  241.0   100.0
63     CCC        2014B         40087            Exam  241.0   100.0
72     CCC        2014J         24299            Exam  269.0   100.0
73     CCC        2014J         40088            Exam  269.0   100.0
87     DDD        2013B         25340            Exam  240.0   100.0
94     DDD        2013J         25354            Exam  261.0   100.0
101    DDD        2014B         25361            Exam  241.0   100.0
108    DDD        2014J         25368            Exam  262.0   100.0
113    EEE        2013J         30713            Exam  235.0   100.0
118    EEE        2014B         30718            Exam  228.0   100.0
123    EEE        2014J         30723            Exam  235.0   100.0
136    FFF        2013B         34872            Exam  222.0   100.0
149    FFF        2013J         34885            Exam  236.0   100.0
162    FFF        2014B         34898            Exam  227.0   100.0
175    FFF        2014J         34911            Exam  241.0   100.0
185    GGG        2013J         37424            Exam  229.0   100.0
195    GGG        2014B         37434            Exam  222.0   100.0
205    GGG        2014J         37444            Exam  229.0   100.0

In [56]:
md(f'''
These {len(missing_exams)} rows all have entries in the assessments dataframe but have no match in the student_assessment dataframe. 
This indicates that no students in our data took these exams. These are all weight 100 and will be the missing final exams.
''')

These 18 rows all have entries in the assessments dataframe but have no match in the student_assessment dataframe.
This indicates that no students in our data took these exams. These are all weight 100 and will be the missing final exams.

In [57]:
# locate the module and presentation for rows in merged_assessments where the weight is 100 and the score is not null
finals_w_scores = merged_assessments.loc[(merged_assessments['weight'] == 100) & (merged_assessments['score'].notna()), ['weight', 'module', 'presentation', 'id_assessment']].drop_duplicates()
finals_w_scores

       weight module presentation id_assessment
52923   100.0    CCC        2014B         24290
63953   100.0    CCC        2014J         24299
69640   100.0    DDD        2013B         25340
82462   100.0    DDD        2013J         25354
87448   100.0    DDD        2014B         25361
95035   100.0    DDD        2014J         25368

In [58]:
ttl_mod_pres = (courses['module'] + courses['presentation']).nunique()
ttl_final_exams = assessments.loc[assessments['assessment_type'] == 'Exam']
mod_pres_w_scores = len(finals_w_scores)
md(f'''Above is a dataframe of all of the modules and presentations we have a final exam for. Only {mod_pres_w_scores} modules out of 
{ttl_mod_pres} have final exam scores for any students.

Since we are missing final exam data for so many students, we cannot use this to make a weighted average for students. It is particularly troublesome
because we have no final exams in GGG whose whole score is based on the final exams since the other exams in GGG are weight 0.

What we will do is base the weighted average on exams that are not the final exam and assign GGG's exams the rounded average of the weights of exams in
modules that have the same number of exams.''')

Above is a dataframe of all of the modules and presentations we have a final exam for. Only 6 modules out of
22 have final exam scores for any students.

Since we are missing final exam data for so many students, we cannot use this to make a weighted average for students. It is particularly troublesome
because we have no final exams in GGG whose whole score is based on the final exams since the other exams in GGG are weight 0.

What we will do is base the weighted average on exams that are not the final exam and assign GGG's exams the rounded average of the weights of exams in
modules that have the same number of exams.

In [266]:
ggg_assessments = assessments.loc[(assessments['module'] == 'GGG') & (assessments['presentation'] == '2014J'), ['presentation', 'id_assessment', 'weight']]

In [269]:
modules = assessments['module'].unique()
presentations = assessments['presentation'].unique()
for i in modules:
    for j in presentations:
        if len(assessments.loc[(assessments['module'] == i) & (assessments['presentation'] == '2014J'), ['presentation', 'id_assessment', 'weight']])  == len(ggg_assessments):
            print(i, j)

CCC 2013J
CCC 2014J
CCC 2013B
CCC 2014B
GGG 2013J
GGG 2014J
GGG 2013B
GGG 2014B

In [313]:
assessments.loc[(assessments['module'] == 'GGG') & (assessments['presentation'] == '2014J'), ['presentation', 'id_assessment', 'weight', 'date']]

    presentation id_assessment  weight   date
196        2014J         37438     0.0  229.0
197        2014J         37439     0.0  229.0
198        2014J         37440     0.0  229.0
199        2014J         37441     0.0  229.0
200        2014J         37442     0.0  229.0
201        2014J         37443     0.0  229.0
202        2014J         37435     0.0   61.0
203        2014J         37436     0.0  124.0
204        2014J         37437     0.0  173.0
205        2014J         37444   100.0  229.0

In [342]:
student_averages = dataframe(merged_assessments.loc[(merged_assessments['module'] == 'GGG') & (merged_assessments['date'] == 229)].groupby('id_student')['score'].mean())
student_averages = student_averages.reset_index()
student_averages

     id_student      score
0        121182       90.0
1        122459  78.666667
2        122846       56.0
3        122928  93.333333
4        125407       85.0
...         ...        ...
1259      80448       80.0
1260      82341       90.0
1261      87929      100.0
1262      96117       88.0
1263       <NA>       <NA>

[1264 rows x 2 columns]

In [349]:
student_assessment.loc[student_assessment['id_student'] == '62975']
merged_assessments.loc[merged_assessments['id_student'] == '62975']

,id_assessment,id_student,date_submitted,is_banked,score,module,presentation,assessment_type,date,weight,_merge
159323,37415,62975,58,0,65,GGG,2013J,TMA,61.0,0.0,both
159482,37416,62975,121,0,65,GGG,2013J,TMA,124.0,0.0,both
161469,37418,62975,94,0,100,GGG,2013J,CMA,229.0,0.0,both
161622,37419,62975,143,0,100,GGG,2013J,CMA,229.0,0.0,both
162353,37420,62975,151,0,100,GGG,2013J,CMA,229.0,0.0,both

In [346]:
fff_students = stud_info.merge(student_averages, how='outer', on='id_student', indicator=True)
fff_students.loc[(fff_students['module'] == 'GGG') & (fff_students['score'].notna()) & (fff_students['result']== 'Fail')]

,module,presentation,id_student,region,imd,age,gender,education,disability,attempts,credits,result,date_registration,date_unregistration,score,_merge
28580,GGG,2013J,587509,East Midlands Region,80-90%,0-35,M,A Level or Equivalent,False,0,30,Fail,-24,<NA>,60.0,both
30121,GGG,2013J,62975,South Region,90-100%,35-55,M,Lower Than A Level,False,0,30,Fail,-53,<NA>,100.0,both
30132,GGG,2013J,122928,East Anglian Region,60-70%,35-55,F,Lower Than A Level,False,0,30,Fail,-40,<NA>,93.333333,both
30138,GGG,2013J,156127,North Western Region,0-10%,0-35,F,Lower Than A Level,False,0,30,Fail,-36,<NA>,100.0,both
30139,GGG,2013J,159484,West Midlands Region,60-70%,0-35,F,A Level or Equivalent,False,0,30,Fail,-110,<NA>,100.0,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32514,GGG,2014J,694070,South West Region,40-50%,35-55,F,Lower Than A Level,False,0,30,Fail,-4,<NA>,93.333333,both
32550,GGG,2014J,699628,Wales,60-70%,35-55,F,A Level or Equivalent,False,0,30,Fail,-7,<NA>,100.0,both
32562,GGG,2014J,1931810,London Region,30-40%,35-55,F,Lower Than A Level,False,0,30,Fail,-141,<NA>,80.0,both
32580,GGG,2014J,2378591,West Midlands Region,30-40%,35-55,F,A Level or Equivalent,False,1,30,Fail,-113,<NA>,44.0,both
32581,GGG,2014J,2456431,South Region,70-80%,0-35,F,Lower Than A Level,True,0,30,Fail,-70,<NA>,93.333333,both

In [309]:
merged_assessments.loc[(merged_assessments['module'] == 'FFF') & (merged_assessments['date'] == 241) ]

,id_assessment,id_student,date_submitted,is_banked,score,module,presentation,assessment_type,date,weight,_merge
149778,34904,653417,220,0,78,FFF,2014J,CMA,241.0,0.0,both
149779,34904,653536,7,0,90,FFF,2014J,CMA,241.0,0.0,both
149780,34904,653558,38,0,94,FFF,2014J,CMA,241.0,0.0,both
149781,34904,653567,187,0,74,FFF,2014J,CMA,241.0,0.0,both
149782,34904,653595,220,0,73,FFF,2014J,CMA,241.0,0.0,both
...,...,...,...,...,...,...,...,...,...,...,...
158689,34910,653115,241,0,81,FFF,2014J,CMA,241.0,0.0,both
158690,34910,653297,226,0,65,FFF,2014J,CMA,241.0,0.0,both
158691,34910,653301,240,0,77,FFF,2014J,CMA,241.0,0.0,both
158692,34910,653381,226,0,88,FFF,2014J,CMA,241.0,0.0,both
173926,34911,<NA>,<NA>,<NA>,<NA>,FFF,2014J,Exam,241.0,100.0,right_only

In [ ]:
# remove tests that students did not take
merged_assessments = merged_assessments.dropna(subset=['id_student'])
# drop the merge column since it is no longer of use
# reset the index to be consecutive again
merged_assessments = merged_assessments.drop(columns=['_merge']).reset_index(drop=True)
# order the columns
merged_assessments = merged_assessments[['module', 'presentation', 'id_student', 'id_assessment', 'assessment_type', 'date_submitted', 'date', 'weight', 'score']]
# make a list of missing exams
missing_exams_list = list(missing_exams['id_assessment'])

In [ ]:
merged_assessments.loc[(merged_assessments['module'] == 'GGG') & (merged_assessments['weight'] != 0.0)]

In [ ]:
merged_assessments.loc[merged_assessments['module'] == 'GGG']

In [158]:
# make a dataframe of all assessments with NaN scores
NaN_scores = student_assessment.loc[student_assessment['score'].isnull() == True]

# make a dataframe of students whose score is NaN from student info
#initiate dataframe to store students with NaN scores
students_w_NaN_scores = pd.DataFrame()

# iterate through NaN_scores
for index, row in NaN_scores.iterrows():
    # if student_id from NaN scores is found in student_info_reg append that students information to a new dataframe students_w_NaN_scores
    students_w_NaN_scores = students_w_NaN_scores.append(stud_info.loc[stud_info['id_student'] == row['id_student']])

In [159]:
# display the new dataframe
students_w_NaN_scores.head()

,module,presentation,id_student,region,imd,age,gender,education,disability,attempts,credits,result,date_registration,date_unregistration
227,AAA,2013J,721259,South Region,50-60%,55<=,F,Lower Than A Level,False,0,120,Withdrawn,-73,23
638,AAA,2014J,721259,South Region,50-60%,55<=,F,Lower Than A Level,False,1,60,Withdrawn,-30,128
108,AAA,2013J,260355,London Region,80-90%,35-55,F,A Level or Equivalent,False,0,60,Withdrawn,-186,170
466,AAA,2014J,260355,London Region,80-90%,35-55,F,A Level or Equivalent,False,1,120,Withdrawn,-156,-87
733,AAA,2014J,2606802,North Region,60-70%,0-35,M,A Level or Equivalent,False,0,60,Fail,-37,<NA>

This dataframe contains the students which are missing scores for their exams

In [ ]:
# get the counts of each student result within the NaN scores dataframe
dataframe(students_w_NaN_scores['result'].value_counts())

For students which withdrew or failed it makes sense that some of their test scores would be missing. For the passed students, it is possible that they still made it by without passing an exam. The student with distinction is of note. Let's check their record first.

In [ ]:
# locate the student in students_w_NaN scores whose final_result was Distinction
students_w_NaN_scores.loc[students_w_NaN_scores['result'] == 'Distinction']

Above we have the student in question with ID 571765. Now let's see the rest of their test scores

In [ ]:
# locate the other test scores of the student with Distinction
student_assessment.loc[student_assessment['id_student'] == '571765'].fillna(0)

According to the data source, a score of 40 or less is interpreted as failure. This student receieved excellent marks on their exams aside from the NaN value which we have filled with a 0 here. It is very possible that this student still received distinction with a 0 on one exam. Also of note is that the exam was submitted late into the module, and possibly defaulted to a 0. Let's do another test case with the first student in the dataframe of students with NaN scores who still passed.

In [ ]:
# locate the students who passed with NaN test scores
students_w_NaN_scores.loc[students_w_NaN_scores['result'] == 'Pass'].head()

Here is the dataframe of students with a NaN value test score who still passed.
We will check the scores of the first student, 502717.

In [ ]:
# locate the test scores of the first passing student with NaN scores
student_assessment.loc[student_assessment['id_student'] == '502717'].fillna(0)

Here we can see the test scores of the student with 502717. Once again we see that it was possible for them to have passed with a 0, and the exam was submitted late into the module.

With this information we will fill the NA values with 0's under the assumption that these exams were not turned in.

In [ ]:
# putting 0 for the NA scores in student_assessment
student_assessment = student_assessment.fillna(0)

In [72]:
# make a dataframe of all assessments with NaN scores
NaN_scores = student_assessment.loc[student_assessment['score'].isnull() == True]
NaN_scores.head()

     id_assessment id_student  date_submitted  is_banked  score
215           1752     721259              22          0   <NA>
937           1754     260355             127          0   <NA>
2364          1760    2606802             180          0   <NA>
3358         14984     186780              77          0   <NA>
3914         14984     531205              26          0   <NA>

Here is a dataframe of the assessments which are missing scores

In [73]:
# make a dataframe of students whose score is NaN from student info
#initiate dataframe to store students with NaN scores
students_w_NaN_scores = pd.DataFrame()

# iterate through NaN_scores
for index, row in NaN_scores.iterrows():
    # if student_id from NaN scores is found in student_info_reg append that students information to a new dataframe students_w_NaN_scores
    students_w_NaN_scores = students_w_NaN_scores.append(stud_info.loc[stud_info['id_student'] == row['id_student']])

In [74]:
# display the new dataframe
students_w_NaN_scores.head()

,module,presentation,id_student,region,imd,age,gender,education,disability,attempts,credits,result,date_registration,date_unregistration
227,AAA,2013J,721259,South Region,50-60%,55<=,F,Lower Than A Level,False,0,120,Withdrawn,-73,23
638,AAA,2014J,721259,South Region,50-60%,55<=,F,Lower Than A Level,False,1,60,Withdrawn,-30,128
108,AAA,2013J,260355,London Region,80-90%,35-55,F,A Level or Equivalent,False,0,60,Withdrawn,-186,170
466,AAA,2014J,260355,London Region,80-90%,35-55,F,A Level or Equivalent,False,1,120,Withdrawn,-156,-87
733,AAA,2014J,2606802,North Region,60-70%,0-35,M,A Level or Equivalent,False,0,60,Fail,-37,<NA>

This dataframe contains the students which are missing scores for their exams

In [ ]:
# get the counts of each student result within the NaN scores dataframe
dataframe(students_w_NaN_scores['result'].value_counts())

For students which withdrew or failed it makes sense that some of their test scores would be missing. For the passed students, it is possible that they still made it by without passing an exam. The student with distinction is of note. Let's check their record first.

In [ ]:
# locate the student in students_w_NaN scores whose final_result was Distinction
students_w_NaN_scores.loc[students_w_NaN_scores['result'] == 'Distinction']

Above we have the student in question with ID 571765. Now let's see the rest of their test scores

In [ ]:
# locate the other test scores of the student with Distinction
student_assessment.loc[student_assessment['id_student'] == '571765'].fillna(0)

According to the data source, a score of 40 or less is interpreted as failure. This student receieved excellent marks on their exams aside from the NaN value which we have filled with a 0 here. It is very possible that this student still received distinction with a 0 on one exam. Also of note is that the exam was submitted late into the module, and possibly defaulted to a 0. Let's do another test case with the first student in the dataframe of students with NaN scores who still passed.

In [ ]:
# locate the students who passed with NaN test scores
students_w_NaN_scores.loc[students_w_NaN_scores['result'] == 'Pass'].head()

Here is the dataframe of students with a NaN value test score who still passed.
We will check the scores of the first student, 502717.

In [ ]:
# locate the test scores of the first passing student with NaN scores
student_assessment.loc[student_assessment['id_student'] == '502717'].fillna(0)

Here we can see the test scores of the student with 502717. Once again we see that it was possible for them to have passed with a 0, and the exam was submitted late into the module.

With this information we will fill the NA values with 0's under the assumption that these exams were not turned in.

In [ ]:
# putting 0 for the NA scores in student_assessment
student_assessment = student_assessment.fillna(0)